// ===== Глобальное состояние (должно подключаться первым) =====
window.resources = [
    "труд",
    "зерно",
    "древесина",
    "железо",
    "камень",
    "хлопок",
    "лён",
    "рыба",
    "глина",
    "хлопок",
    "оружие",
    "доспех",
    "ремесленные материалы",
    "алхимические материалы",
    "золото",
    "труд алхимика",
    "труд мага",
    "кожа",
    "магический предмет"

];

window.enabled   = {
    "труд":true,
    "зерно":true,
    "древесина":true,
    "железо":true,
    "камень":true,
    "хлопок":true,
    "лён":true,
    "рыба":true,
    "глина":true,
    "хлеб":true,
    "оружие":true,
    "доспех":true,
    "ремесленные материалы": true,
    "алхимические материалы": true,
    "золото":true,
    "труд алхимика": true,
    "труд мага": true,
    "кожа": true,
    "магический предмет": true
};

window.basePrice = {
    "труд":1,
    "зерно":0.04,
    "древесина":0.01,
    "железо":0.6,
    "камень":0.015,
    "хлопок":2,
    "лён":0.5,
    "рыба":0.07, 
    "глина":0.01,   
    "хлеб":0.062,
    "оружие":0.01,
    "доспех":0.01,
    "ремесленные материалы":0.01,
    "алхимические материалы":0.01,
    "золото":100,
    "труд алхимика": 8,
    "труд мага": 10,
    "кожа":2,
    "магический предмет": 10
};
window.elasticity= {
    "труд":0.7,
    "зерно":0.8,
    "древесина":0.9,
    "железо":1.0,
    "камень":0.8,
    "рыба":0.9,
    "глина":0.8,
    "хлеб":0.6,
    "оружие":1.2,
    "доспех":1.2,
    "ремесленные материалы":0.6,
    "алхимические материалы":0.7,
    "золото":0.6,
    "труд алхимика": 8,
    "труд мага": 10,
    "кожа":0.7,
    "магический предмет":0.1
};

// basePrice["ремесленные материалы"] = 0.01;   // 1 медная
// elasticity["ремесленные материалы"] = 0.6;
// manualDemand["ремесленные материалы"] = 0;
// manualSupply["ремесленные материалы"] = 0;
window.manualDemand = {}; window.manualSupply = {};
resources.forEach(r=>{ manualDemand[r]=0; manualSupply[r]=0; });

window.markups = {transport:0.10, storage:0.05, risk:0.00, profit:0.10};

window.items = [

     {
      "id": 1,
      "name": "древесина",
      "type": ["древесина"],
      "unit": "м³",
      "compound": [],
      "isResource": true
    },
    {
      "id": 2,
      "name": "камень",
      "type": ["камень"],
      "unit": "кг",
      "compound": [],
      "isResource": true
    },
    {
      "id": 3,
      "name": "железо",
      "type": ["железо"],
      "unit": "кг",
      "compound": [],
      "isResource": true
    },
    {
      "id": 4,
      "name": "уголь",
      "type": ["ремесленные материалы"],
      "unit": "кг",
      "compound": [
        { "itemId": 1, "qty": 2 },
        { "itemId": 10, "qty": 0.3 }
      ]
    },
    {
      "id": 5,
      "name": "глина",
      "type": ["глина"],
      "unit": "кг",
      "compound": [],
      "isResource": true
    },
    {
      "id": 6,
      "name": "хлопок",
      "type": ["хлопок"],
      "unit": "кг",
      "compound": [],
      "isResource": true
    },
    {
      "id": 7,
      "name": "лён",
      "type": ["лён"],
      "unit": "кг",
      "compound": [],
      "isResource": true
    },
    {
      "id": 8,
      "name": "кожа",
      "type": ["кожа"],
      "unit": "кг",
      "compound": [],
      "isResource": true
    },
    {
      "id": 9,
      "name": "сталь",
      "type": ["ремесленные материалы"],
      "unit": "кг",
      "compound": [
        { "itemId": 3, "qty": 1 },
        { "itemId": 4, "qty": 0.5 },
        { "itemId": 10, "qty": 1 }
      ]
    },
    {
      "id": 10,
      "name": "труд",
      "type": ["труд"],
      "unit": "дни",
      "compound": [],
      "isResource": true
    },
    {
      "id": 11,
      "name": "гвозди",
      "type": ["ремесленные материалы"],
      "unit": "кг",
      "compound": [
        { "itemId": 3, "qty": 1 },
        { "itemId": 4, "qty": 1 },
        { "itemId": 10, "qty": 0.125 }
      ]
    },
    {
      "id": 12,
      "name": "проволока",
      "type": ["ремесленные материалы"],
      "unit": "кг",
      "compound": [
        { "itemId": 9, "qty": 1 },
        { "itemId": 4, "qty": 0.3 },
        { "itemId": 10, "qty": 0.2 }
      ]
    },
    {
      "id": 13,
      "name": "кирпич",
      "type": ["ремесленные материалы"],
      "unit": "шт",
      "compound": [
        { "itemId": 5, "qty": 2 },
        { "itemId": 10, "qty": 0.1 }
      ]
    },
    {
      "id": 14,
      "name": "верёвка",
      "type": ["ремесленные материалы"],
      "unit": "м",
      "compound": [
        { "itemId": 7, "qty": 0.5 },
        { "itemId": 10, "qty": 0.1 }
      ]
    },
    {
      "id": 15,
      "name": "ткань льняная",
      "type": ["ремесленные материалы"],
      "unit": "м²",
      "compound": [
        { "itemId": 7, "qty": 1 },
        { "itemId": 10, "qty": 0.3 }
      ]
    },
    {
      "id": 16,
      "name": "гамбезон",
      "type": ["доспех"],
      "unit": "шт",
      "compound": [
        { "itemId": 15, "qty": 5 },
        { "itemId": 10, "qty": 5 }
      ]
    },
    {
      "id": 17,
      "name": "кольчуга",
      "type": ["доспех"],
      "unit": "шт",
      "compound": [
        { "itemId": 12, "qty": 10 },
        { "itemId": 10, "qty": 20 }
      ]
    },
    {
      "id": 18,
      "name": "латы",
      "type": ["доспех"],
      "unit": "шт",
      "compound": [
        { "itemId": 17, "qty": 1 },
        { "itemId": 16, "qty": 1 },
        { "itemId": 9, "qty": 30 },
        { "itemId": 8, "qty": 10 },
        { "itemId": 4, "qty": 50 },
        { "itemId": 10, "qty": 300 }
      ]
    },
    { "id": 19, "name": "Корень женьшеня", "type": ["алхимические материалы"], "unit": "ед", "compound": [{ "itemId": 10, "qty": 0.486 }] },
    { "id": 20, "name": "Мох целебный", "type": ["алхимические материалы"], "unit": "ед", "compound": [{ "itemId": 10, "qty": 0.517 }] },
    { "id": 21, "name": "Крылья ночного мотылька", "type": ["алхимические материалы"], "unit": "ед", "compound": [{ "itemId": 10, "qty": 0.492 }] },
    { "id": 22, "name": "Кровь ящерицы", "type": ["алхимические материалы"], "unit": "ед", "compound": [{ "itemId": 10, "qty": 0.511 }] },
    { "id": 23, "name": "Корень плюща", "type": ["алхимические материалы"], "unit": "ед", "compound": [{ "itemId": 10, "qty": 0.478 }] },
    { "id": 24, "name": "Жареное кофейное зерно", "type": ["алхимические материалы"], "unit": "ед", "compound": [{ "itemId": 10, "qty": 0.503 }] },
    { "id": 25, "name": "Мёд", "type": ["алхимические материалы"], "unit": "ед", "compound": [{ "itemId": 10, "qty": 0.524 }] },

    { "id": 26, "name": "Водоросль русалки", "type": ["алхимические материалы"], "unit": "ед", "compound": [{ "itemId": 10, "qty": 5.17 }] },
    { "id": 27, "name": "Экстракт слизи", "type": ["алхимические материалы"], "unit": "ед", "compound": [{ "itemId": 10, "qty": 4.91 }] },
    { "id": 28, "name": "Крылья осы танто", "type": ["алхимические материалы"], "unit": "ед", "compound": [{ "itemId": 10, "qty": 5.11 }] },
    { "id": 29, "name": "Жабры рыбы Сги", "type": ["алхимические материалы"], "unit": "ед", "compound": [{ "itemId": 10, "qty": 4.84 }] },
    { "id": 30, "name": "Порошок обсидиана", "type": ["алхимические материалы"], "unit": "ед", "compound": [{ "itemId": 10, "qty": 5.08 }] },

    { "id": 31, "name": "Слеза банши", "type": ["алхимические материалы"], "unit": "фл", "compound": [{ "itemId": 10, "qty": 51.7 }] },
    { "id": 32, "name": "Прах тени", "type": ["алхимические материалы"], "unit": "г", "compound": [{ "itemId": 10, "qty": 48.6 }] },
    { "id": 33, "name": "Перо грифона", "type": ["алхимические материалы"], "unit": "ед", "compound": [{ "itemId": 10, "qty": 52.4 }] },
    { "id": 34, "name": "Осколки элементалей", "type": ["алхимические материалы"], "unit": "ед", "compound": [{ "itemId": 10, "qty": 49.3 }] },
    { "id": 35, "name": "Кровь минотавра", "type": ["алхимические материалы"], "unit": "фл", "compound": [{ "itemId": 10, "qty": 51.1 }] },
    { "id": 36, "name": "Звёздный мох", "type": ["алхимические материалы"], "unit": "ед", "compound": [{ "itemId": 10, "qty": 50.7 }] },

    { "id": 37, "name": "Око василиска", "type": ["алхимические материалы"], "unit": "ед", "compound": [{ "itemId": 10, "qty": 511 }] },
    { "id": 38, "name": "Кристалл ртути", "type": ["алхимические материалы"], "unit": "ед", "compound": [{ "itemId": 10, "qty": 489 }] },
    { "id": 39, "name": "Кость гиганта", "type": ["алхимические материалы"], "unit": "ед", "compound": [{ "itemId": 10, "qty": 505 }] }
    // {
    //   "id": 19,
    //   "name": "Корень женьшеня",
    //   "type": ["алхимические материалы"],
    //   "unit": "ед",
    //   "compound": [{ "itemId": 10, "qty": 0.513 }]
    // },
    // {
    //   "id": 20,
    //   "name": "Мох целебный",
    //   "type": ["алхимические материалы"],
    //   "unit": "ед",
    //   "compound": [{ "itemId": 10, "qty": 0.489 }]
    // },
    // {
    //   "id": 21,
    //   "name": "Водоросль русалки",
    //   "type": ["алхимические материалы"],
    //   "unit": "ед",
    //   "compound": [{ "itemId": 10, "qty": 5.23 }]
    // },
    // {
    //   "id": 22,
    //   "name": "Слеза банши",
    //   "type": ["алхимические материалы"],
    //   "unit": "фл",
    //   "compound": [{ "itemId": 10, "qty": 48.9 }]
    // },
    // {
    //   "id": 23,
    //   "name": "Око василиска",
    //   "type": ["алхимические материалы"],
    //   "unit": "ед",
    //   "compound": [{ "itemId": 10, "qty": 511.3 }]
    // }
];    

// таблица товаров
window.contracts = [];       // контракты
window.market = {};          // биржевые параметры по itemId
window.lastPriceMap = {};    // карта текущих цен (ресурсы)
window.activeWorld = new Set();
window.activeSeasons = new Set();

// UI state для «Товары»
window.itemsSearchTerm = "";
window.itemsTypeFilter = "all";     // all | onlyResources | onlyComposite | res:<name>
window.itemsSort = "idAsc";     // priceAsc | priceDesc | nameAsc | nameDesc
